bashyal/Applications/Solvers/interHFDIBfoam/interHFDIBfoam_test/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// Slope 1:10 (V:H) -> angle = atan(0.1)
// Length = 1.0 m (horizontal projection)
// Height = 0.1 m
// Width = 0.1 m

// Vertices
vertices
(
    (0 0 0)             // 0
    (1.0 0 0)           // 1
    (1.0 0.1 0)         // 2
    (0 0.1 0)           // 3
    (0 0 0.1)           // 4
    (1.0 0 0.1)         // 5
    (1.0 0.1 0.1)       // 6
    (0 0.1 0.1)         // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 20 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
